#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jmespath/jmespath"
tap "teamookla/speedtest"
tap "toonetown/homebrew-xcode"
#
cask "atom", args: { appdir: "~/Applications" }
cask "ableton-live-suite10", args: { appdir: "~/Applications" }
cask "discord", args: { appdir: "~/Applications" }
cask "dropbox", args: { appdir: "~/Applications" }
cask "github", args: { appdir: "~/Applications" }
cask "jqbx", args: { appdir: "~/Applications" }
cask "macvim", args: { appdir: "~/Applications" }
cask "session-manager-plugin", args: { appdir: "~/Applications" }
cask "sourcetree", args: { appdir: "~/Applications" }
cask "spotify", args: { appdir: "~/Applications" }
cask "virtualbox", args: { appdir: "~/Applications" }
cask "vivaldi", args: { appdir: "~/Applications" }
cask "whatsapp", args: { appdir: "~/Applications" }
cask "alacritty", args: { appdir: "~/Applications" }
cask "hyper", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
#
brew "ack"
brew "ag"
brew "ansible"
brew "carting"
brew "carthage"
brew "cfn-lint"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "findutils"
brew "fortune"
brew "gitui"
brew "glow"
brew "gpg2"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "httpie"
brew "imath"
brew "jp"
brew "libmagic"
brew "lolcat"
brew "mas"
brew "mercurial"
brew "nmap"
brew "openssl"
brew "packer"
brew "qt"
brew "rain"
brew "readline"
brew "ruby-install"
brew "shellcheck"
brew "spark"
brew "speedtest"
brew "teamookla/speedtest/speedtest"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yasm"
brew "zlib"

# tap "mas-cli/tap/mas"
# brew "pyenv-virtualenv"
# brew "pyenv"
# brew "ipython"
# brew "gnutls"
# brew "lsblk"
#
# cask "xcode", args: { appdir: "~/Applications" }
