cask_args appdir: "~/Applications"
#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "toonetown/homebrew-xcode"
tap "aws/tap"
tap "upbound/tap"
tap "jmespath/jmespath"
#
cask "alacritty"
cask "authy"
cask "ableton-live-suite10"
cask "battle-net", greedy: true,  args: { appdir: "/Applications" }
cask "docker"
cask "discord"
cask "dropbox"
cask "github"
cask "gog-galaxy"
cask "hyper"
cask "iterm2"
cask "jqbx"
cask "postman"
cask "pulsar"
cask "rar"
cask "session-manager-plugin"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "vivaldi"
cask "vscodium"
#

brew "ag"
brew "aws-google-auth"
brew "aws-shell"
brew "awscli"
brew "cffi"
brew "cfn-lint"
brew "cmatrix"
brew "colordiff"
brew "composer"
brew "cowsay"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "findutils"
brew "fortune"
brew "gitui"
brew "glow"
brew "go"
brew "gomplate"
brew "gpg2"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "httpie"
brew "helm"
brew "imath"
brew "jmespath/jmespath/jp"
brew "jq"
brew "just"
brew "k9s"
brew "kind"

brew "libmagic"
brew "lolcat"
brew "mas"
brew "mercurial"
brew "nmap"
brew "openapi-generator"
brew "openssl"
brew "packer"
brew "php"
brew "pycparser"

brew "p7zip"
brew "qemu"
brew "qt"
brew "rain"
brew "readline"
brew "shellcheck"
brew "skaffold"
brew "spark"
brew "teamookla/speedtest/speedtest"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yasm"


# cask_args greedy: true
# cask_args greedy_auto_updates: true
#
# tap "mas-cli/tap/mas"
# tap "jmespath/jmespath/jp"
# tap "homebrew/core"
#
# cask "atom"
# cask "virtualbox"
# cask "whatsapp"
# cask "xcode", args: { appdir: "/Applications" }
#
# brew "ack"
# brew "aws-sam-cli"
# brew "ansible"
# brew "bash"
# brew "bash-completion@2"
# brew "coreutils"
# brew "pyenv"
# brew "ipython"
# brew "kubectl"
# brew "gnutls"
# brew "lsblk"
# brew "carting"
# brew "carthage"
# brew "docker-completion"
# brew "pyenv-virtualenv"
# brew "python@3.8" # required by aws-sam-cli
# brew "nvm"
# brew "upbound/tap/up"
# brew "zlib"
