#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "teamookla/speedtest"
tap "toonetown/homebrew-xcode"
tap "aws/tap"
tap "upbound/tap"
tap "jmespath/jmespath"
#
cask "atom", args: { appdir: "~/Applications" }
cask "authy", args: { appdir: "~/Applications" }
cask "ableton-live-suite10", args: { appdir: "~/Applications" }
cask "battle-net", args: { appdir: "~/Applications" }
cask "docker", args: { appdir: "~/Applications" }
cask "discord", args: { appdir: "~/Applications" }
cask "dropbox", args: { appdir: "~/Applications" }
cask "github", args: { appdir: "~/Applications" }
cask "gog-galaxy", args: { appdir: "~/Applications" }
cask "jqbx", args: { appdir: "~/Applications" }
cask "macvim", args: { appdir: "~/Applications" }
cask "session-manager-plugin", args: { appdir: "~/Applications" }
cask "sourcetree", args: { appdir: "~/Applications" }
cask "spotify", args: { appdir: "~/Applications" }
cask "steam", args: { appdir: "~/Applications" }
cask "vivaldi", args: { appdir: "~/Applications" }
cask "whatsapp", args: { appdir: "~/Applications" }
cask "alacritty", args: { appdir: "~/Applications" }
cask "hyper", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
cask "postman", args: { appdir: "~/Applications" }
cask "rar", args: { appdir: "~/Applications" }
cask "vscodium", args: { appdir: "~/Applications" }
#
brew "ack"
brew "ag"
brew "ansible"
brew "aws-google-auth"
brew "aws-sam-cli"
brew "aws-shell"
brew "awscli"
brew "cfn-lint"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "findutils"
brew "fortune"
brew "gitui"
brew "glow"
brew "gpg2"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "httpie"
brew "helm"
brew "imath"
brew "jmespath/jmespath/jp"
brew "jq"
brew "k9s"
brew "kind"
brew "kubectl"
brew "libmagic"
brew "lolcat"
brew "mas"
brew "mercurial"
brew "nmap"
brew "openapi-generator"
brew "openssl"
brew "packer"
brew "p7zip"
brew "qemu"
brew "qt"
brew "rain"
brew "readline"
brew "ruby-install"
brew "shellcheck"
brew "spark"
brew "teamookla/speedtest/speedtest"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "upbound/tap/up"
brew "watch"
brew "wget"
brew "yasm"
brew "zlib"

# tap "mas-cli/tap/mas"
# tap "jmespath/jmespath/jp"
# brew "pyenv-virtualenv"
# brew "pyenv"
# brew "ipython"
# brew "gnutls"
# brew "lsblk"
# brew "carting"
# brew "carthage"
# brew "docker-completion"
#
# cask "xcode", args: { appdir: "~/Applications" }
# cask "virtualbox", args: { appdir: "~/Applications" }
