tap "homebrew/cask"
cask "atom", args: { appdir: "~/Applications" }
cask "google-chrome", args: { appdir: "~/Applications" }
cask "firefox", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
cask "vivaldi", args: { appdir: "~/Applications" }
cask "sourcetree", args: { appdir: "~/Applications" }
cask "remote-desktop-connection", args: { appdir: "~/Applications" }
brew "htop"
brew "wget"
brew "nmap"
brew "httpie"
brew "pyenv"
brew "ipython"
brew "terraform"
brew "packer"
brew "ansible"
brew "qt"
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "ack"
brew "tree"
brew "spark"
brew "lolcat"
brew "cowsay"
brew "shellcheck"
brew "mercurial"
brew "readline"
brew "openssl"
brew "zlib"
brew "libmagic"
#brew "pyenv-virtualenv"
brew "colordiff"
